app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.get_ratings

    @checked_ratings = params[:ratings] if params.has_key? 'ratings'
    @ordered_by = params[:order_by] if params.has_key? 'order_by'
    #fail

    # session.clear where user submit empty rating filters
    if params.has_key? 'utf8'
      session.delete :checked_ratings
      session.delete :ordered_by
    end

    # update session from incoming params
    session[:checked_ratings] = @checked_ratings if @checked_ratings
    session[:ordered_by] = @ordered_by if @ordered_by

    if !@checked_ratings && !@ordered_by && session[:checked_ratings]
      @checked_ratings = session[:checked_ratings] unless @checked_ratings
      @ordered_by = session[:ordered_by] unless @ordered_by

      flash.keep
      redirect_to movies_path({order_by: @ordered_by, ratings: @checked_ratings.keys})
    end

    if @checked_ratings
      if @ordered_by
        @movies = Movie.find_all_by_rating(@checked_ratings.keys, :order => "#{@ordered_by} asc")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date

        @movies = Movie.find_all_by_rating(@checked_ratings.keys)
      end
    elsif @ordered_by
      @movies = Movie.all(:order => "#{@ordered_by} asc")
---
SELECT "movies".* FROM "movies" ORDER BY release_date asc